設計書の修正
